# Basic Pandas Library

Pandas library uses : Data manipulation, cleaning, Transoformation, visualization --> EDA(Exploratory data analysis)

Pandas Topics 

Data structure: 

series: 1D labeled homogeneously-typed array

dataframe: General 2D labeled, size-mutable tabular structure with potentially heterogeneously-typed column

Reading diffrent file formates.

exporting  files to excel, csv,etc'

selection of specific data

slicing on index

shape and size , type of data

loc/ iloc

ploting using pandas

creating new columns / renaming new columns

calculating the summary statistics

groupby,sort_values, value_counts,aggrgation,pivote.pivote_table,melt

reshaping the table, combining tables

merge files,concate

time series data, extracting time related data.

resampling the time series data

manipulation of textual data

In [ ]:
!pip install pandas

In [1]:
import pandas as pd

In [8]:
age = [20,25,26,27,28,29,25,31,32,33,40,50]
print(age)

[20, 25, 26, 27, 28, 29, 25, 31, 32, 33, 40, 50]

In [9]:
type(age)

list

# seriese type data

In [16]:
age_series = pd.Series(age,name = 'age',dtype = 'float64')
type(age_series)

In [18]:
print(age_series)

0     20.0
1     25.0
2     26.0
3     27.0
4     28.0
5     29.0
6     25.0
7     31.0
8     32.0
9     33.0
10    40.0
11    50.0
Name: age, dtype: float64

In [21]:
age_series.describe(),age_series.kurt(),age_series.info()

<class 'pandas.core.series.Series'>
RangeIndex: 12 entries, 0 to 11
Series name: age
Non-Null Count  Dtype
--------------  -----
12 non-null     float64
dtypes: float64(1)
memory usage: 228.0 bytes

(count    12.000000
 mean     30.500000
 std       7.925792
 min      20.000000
 25%      25.750000
 50%      28.500000
 75%      32.250000
 max      50.000000
 Name: age, dtype: float64,
 2.6499989179325114,
 None)

In [23]:
print(age,age_series,sep='\n')

[20, 25, 26, 27, '28', (29+2j), None, 31, 32, 33, 40, 50]
0          20
1          25
2          26
3          27
4          28
5     (29+2j)
6        None
7          31
8          32
9          33
10         40
11         50
dtype: object

# dataframe

<!-- # Dataframe:  -->

In [23]:
data =  {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
            "Rajesh, Mr. Owen Harris",
            "Anish, Mr. William Henry",
            "Asif, Miss. Elizabeth"],
    
        "Age": [22, 35, 58,50,0,0],
        "Sex": ["male", "male", "female","male","male","female"],
    "Education":["BE","Btech","MBS","BE","MBA","MBA"]
    }
print(type(data))

<class 'dict'>

In [24]:
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [25]:
df

                       Name  Age     Sex Education
0   Braund, Mr. Owen Harris   22    male        BE
1  Allen, Mr. William Henry   35    male     Btech
2  Bonnell, Miss. Elizabeth   58  female       MBS
3   Rajesh, Mr. Owen Harris   50    male        BE
4  Anish, Mr. William Henry    0    male       MBA
5     Asif, Miss. Elizabeth    0  female       MBA

In [27]:
df.dtypes

Name         object
Age           int64
Sex          object
Education    object
dtype: object

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       6 non-null      object
 1   Age        6 non-null      int64
 2   Sex        6 non-null      object
 3   Education  6 non-null      object
dtypes: int64(1), object(3)
memory usage: 324.0+ bytes

In [30]:
df.select_dtypes('object')

                       Name     Sex Education
0   Braund, Mr. Owen Harris    male        BE
1  Allen, Mr. William Henry    male     Btech
2  Bonnell, Miss. Elizabeth  female       MBS
3   Rajesh, Mr. Owen Harris    male        BE
4  Anish, Mr. William Henry    male       MBA
5     Asif, Miss. Elizabeth  female       MBA

In [27]:
# for series
age_series.dtype

dtype('O')

In [28]:
# for dataframe
df.dtypes

Name         object
Age           int64
Sex          object
Education    object
dtype: object

In [31]:
# column names
df.columns

Index(['Name', 'Age', 'Sex', 'Education'], dtype='object')

In [33]:
type(df['Age'])

pandas.core.series.Series

In [35]:
type(df['Age'].values)

numpy.ndarray

In [36]:
# choosen values inside a dataframe.
df_values = df.values
print(df_values)

[['Braund, Mr. Owen Harris' 22 'male' 'BE']
 ['Allen, Mr. William Henry' 35 'male' 'Btech']
 ['Bonnell, Miss. Elizabeth' 58 'female' 'MBS']
 ['Rajesh, Mr. Owen Harris' 50 'male' 'BE']
 ['Anish, Mr. William Henry' 0 'male' 'MBA']
 ['Asif, Miss. Elizabeth' 0 'female' 'MBA']]

In [37]:
# Number of dimention
df_values.ndim

2

In [38]:
df_values.shape

(6, 4)

In [39]:
# shape of rows and columns
df_values.shape[0]

6

In [40]:
df_values.shape[1]

4

In [41]:
df['Sex'].value_counts()

Sex
male      4
female    2
Name: count, dtype: int64

In [42]:
df['Education'].value_counts()

Education
BE       2
MBA      2
Btech    1
MBS      1
Name: count, dtype: int64

In [46]:
df['Age'][0] = 52

C:\Users\excel\AppData\Local\Temp\ipykernel_28500\842622839.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Age'][0] = 52

In [48]:
df['Age'].mean()

32.5

In [49]:
df['Age'][4] = df['Age'].mean()

C:\Users\excel\AppData\Local\Temp\ipykernel_28500\911804413.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Age'][4] = df['Age'].mean()
C:\Users\excel\AppData\Local\Temp\ipykernel_28500\911804413.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '32.5' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df['Age'][4] = df['Age'].mean()

In [50]:
df['Age'][5] = df['Age'].mean()

In [52]:
df['Age'] = df['Age'].astype(int)

In [56]:
df.describe(include = ['object','int'])

                           Name        Age   Sex Education
count                         6   6.000000     6         6
unique                        6        NaN     2         4
top     Braund, Mr. Owen Harris        NaN  male        BE
freq                          1        NaN     4         2
mean                        NaN  44.000000   NaN       NaN
std                         NaN  10.677078   NaN       NaN
min                         NaN  32.000000   NaN       NaN
25%                         NaN  35.500000   NaN       NaN
50%                         NaN  43.500000   NaN       NaN
75%                         NaN  51.500000   NaN       NaN
max                         NaN  58.000000   NaN       NaN

In [58]:
df.describe(exclude = ['int'])

                           Name   Sex Education
count                         6     6         6
unique                        6     2         4
top     Braund, Mr. Owen Harris  male        BE
freq                          1     4         2

In [66]:
# axis = 0 row data, axis = 1 column
df.rename({'Name':'Student_name',
          'Sex':'Gender'},axis = 1)

               Student_name  Age  Gender Education
0   Braund, Mr. Owen Harris   52    male        BE
1  Allen, Mr. William Henry   35    male     Btech
2  Bonnell, Miss. Elizabeth   58  female       MBS
3   Rajesh, Mr. Owen Harris   50    male        BE
4  Anish, Mr. William Henry   32    male       MBA
5     Asif, Miss. Elizabeth   37  female       MBA

In [67]:
df.drop('Sex',axis = 1,inplace = True)

In [62]:
df2 = df.drop('Age', axis = 1)

In [71]:
df2[df2['Sex'] == 'male']

                       Name   Sex Education
0   Braund, Mr. Owen Harris  male        BE
1  Allen, Mr. William Henry  male     Btech
3   Rajesh, Mr. Owen Harris  male        BE
4  Anish, Mr. William Henry  male       MBA

In [ ]:
# sort values
df.sort_values(by='Age',ascending=False)

In [ ]:
# group by
df.groupby('Education')['Age'].mean().sort_values(ascending=False)

# Analysis using pandas

In [81]:
## Reading data
import pandas as pd
salaries_df = pd.read_csv(r"D:\DS-Batch1\DS dataset\Salaries.csv")
salaries_df

         rank discipline  phd  service     sex  salary
0        Prof          A   51       51    Male   57800
1   AssocProf          A   25       22  Female   62884
2    AsstProf          A    7        6  Female   63100
3   AssocProf          B   12        9  Female   71065
4    AsstProf          A    2        0  Female   72500
..        ...        ...  ...      ...     ...     ...
73       Prof          B   22       21    Male  155750
74       Prof          A   45       43    Male  155865
75       Prof          B   24       15  Female  161101
76       Prof          B   35       33    Male  162200
77       Prof          B   56       49    Male  186960

[78 rows x 6 columns]

In [ ]:
# check the data types of every column.
# check for number of rows and columns
# check for summary statistics for numerical and categorical column separatly.

In [ ]:
# how many unique observation in Rank, desciplane

In [2]:
type(salaries_df)

pandas.core.frame.DataFrame

In [3]:
salaries_df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [4]:
salaries_df.shape

(78, 6)

In [7]:
# first 5 values/ last 5 values
print(salaries_df.head())
print(salaries_df.tail())

        rank discipline  phd  service     sex  salary
0       Prof          A   51       51    Male   57800
1  AssocProf          A   25       22  Female   62884
2   AsstProf          A    7        6  Female   63100
3  AssocProf          B   12        9  Female   71065
4   AsstProf          A    2        0  Female   72500
    rank discipline  phd  service     sex  salary
73  Prof          B   22       21    Male  155750
74  Prof          A   45       43    Male  155865
75  Prof          B   24       15  Female  161101
76  Prof          B   35       33    Male  162200
77  Prof          B   56       49    Male  186960

In [8]:
#Information about data:
salaries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [82]:
# summary statistics
salaries_df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [ ]:
# for docs of funtion: shift + tab

In [11]:
salaries_df.describe(include = ['object','int64'])

        rank discipline        phd    service   sex         salary
count     78         78  78.000000  78.000000    78      78.000000
unique     3          2        NaN        NaN     2            NaN
top     Prof          B        NaN        NaN  Male            NaN
freq      46         42        NaN        NaN    39            NaN
mean     NaN        NaN  19.705128  15.051282   NaN  108023.782051
std      NaN        NaN  12.498425  12.139768   NaN   28293.661022
min      NaN        NaN   1.000000   0.000000   NaN   57800.000000
25%      NaN        NaN  10.250000   5.250000   NaN   88612.500000
50%      NaN        NaN  18.500000  14.500000   NaN  104671.000000
75%      NaN        NaN  27.750000  20.750000   NaN  126774.750000
max      NaN        NaN  56.000000  51.000000   NaN  186960.000000

In [14]:
salaries_df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [83]:
salaries_df.describe(exclude=['int64'])

        rank discipline   sex
count     78         78    78
unique     3          2     2
top     Prof          B  Male
freq      46         42    39

In [16]:
salaries_df.values

array([['Prof', 'A', 51, 51, 'Male', 57800],
       ['AssocProf', 'A', 25, 22, 'Female', 62884],
       ['AsstProf', 'A', 7, 6, 'Female', 63100],
       ['AssocProf', 'B', 12, 9, 'Female', 71065],
       ['AsstProf', 'A', 2, 0, 'Female', 72500],
       ['AsstProf', 'A', 3, 1, 'Female', 72500],
       ['AsstProf', 'A', 4, 2, 'Male', 73000],
       ['AssocProf', 'A', 26, 24, 'Female', 73300],
       ['AsstProf', 'A', 5, 3, 'Female', 73500],
       ['AsstProf', 'B', 11, 3, 'Female', 74692],
       ['AssocProf', 'A', 13, 8, 'Female', 74830],
       ['AsstProf', 'B', 8, 3, 'Male', 75044],
       ['AsstProf', 'B', 5, 0, 'Female', 77000],
       ['AssocProf', 'A', 10, 8, 'Female', 77500],
       ['AsstProf', 'A', 4, 2, 'Female', 77500],
       ['AsstProf', 'A', 8, 3, 'Female', 78500],
       ['AsstProf', 'B', 4, 2, 'Female', 80225],
       ['AssocProf', 'A', 20, 17, 'Male', 81285],
       ['AsstProf', 'A', 2, 0, 'Male', 85000],
       ['AsstProf', 'B', 1, 0, 'Male', 88000],
       ['Prof', 'A', 17, 11, 'Female', 90450],
       ['AsstProf', 'B', 4, 3, 'Male', 91000],
       ['Prof', 'A', 29, 27, 'Female', 91000],
       ['Prof', 'A', 30, 23, 'Male', 91100],
       ['AsstProf', 'B', 7, 2, 'Male', 91300],
       ['AsstProf', 'B', 4, 0, 'Male', 92000],
       ['AsstProf', 'B', 4, 4, 'Male', 92000],
       ['AsstProf', 'B', 3, 3, 'Female', 92000],
       ['Prof', 'A', 12, 6, 'Male', 93000],
       ['Prof', 'A', 29, 19, 'Male', 94350],
       ['AsstProf', 'B', 10, 5, 'Female', 97032],
       ['Prof', 'B', 35, 31, 'Male', 99418],
       ['Prof', 'A', 20, 8, 'Male', 102000],
       ['Prof', 'A', 33, 30, 'Male', 103106],
       ['Prof', 'A', 27, 19, 'Male', 103275],
       ['AssocProf', 'B', 11, 11, 'Female', 103613],
       ['AssocProf', 'B', 13, 10, 'Female', 103750],
       ['AssocProf', 'B', 12, 10, 'Female', 103994],
       ['AssocProf', 'B', 19, 6, 'Female', 104542],
       ['Prof', 'B', 20, 18, 'Male', 104800],
       ['Prof', 'A', 12, 0, 'Female', 105000],
       ['Prof', 'B', 18, 10, 'Female', 105450],
       ['AssocProf', 'B', 9, 7, 'Male', 107008],
       ['Prof', 'A', 19, 7, 'Male', 107300],
       ['Prof', 'A', 23, 15, 'Female', 109646],
       ['AssocProf', 'B', 14, 7, 'Female', 109650],
       ['Prof', 'A', 28, 14, 'Female', 109954],
       ['Prof', 'A', 23, 20, 'Male', 110515],
       ['Prof', 'B', 17, 17, 'Female', 111512],
       ['Prof', 'A', 28, 7, 'Female', 116450],
       ['Prof', 'A', 36, 19, 'Female', 117555],
       ['AssocProf', 'B', 12, 8, 'Male', 119800],
       ['Prof', 'B', 18, 18, 'Male', 120000],
       ['Prof', 'A', 20, 20, 'Male', 122400],
       ['Prof', 'B', 17, 18, 'Female', 122960],
       ['Prof', 'B', 21, 20, 'Male', 123683],
       ['Prof', 'B', 17, 17, 'Female', 124312],
       ['Prof', 'A', 18, 18, 'Male', 126300],
       ['Prof', 'B', 28, 23, 'Male', 126933],
       ['Prof', 'B', 20, 14, 'Female', 127512],
       ['Prof', 'B', 39, 33, 'Male', 128250],
       ['Prof', 'B', 18, 18, 'Female', 129000],
       ['Prof', 'A', 40, 31, 'Male', 131205],
       ['Prof', 'B', 23, 23, 'Male', 134778],
       ['Prof', 'A', 39, 36, 'Female', 137000],
       ['Prof', 'B', 25, 25, 'Female', 140096],
       ['Prof', 'B', 36, 26, 'Female', 144651],
       ['Prof', 'B', 45, 45, 'Male', 146856],
       ['Prof', 'A', 38, 19, 'Male', 148750],
       ['Prof', 'B', 17, 3, 'Male', 150480],
       ['Prof', 'A', 29, 27, 'Male', 150500],
       ['Prof', 'B', 23, 19, 'Female', 151768],
       ['Prof', 'B', 25, 19, 'Male', 153750],
       ['Prof', 'B', 22, 21, 'Male', 155750],
       ['Prof', 'A', 45, 43, 'Male', 155865],
       ['Prof', 'B', 24, 15, 'Female', 161101],
       ['Prof', 'B', 35, 33, 'Male', 162200],
       ['Prof', 'B', 56, 49, 'Male', 186960]], dtype=object)

In [17]:
salaries_df.value_counts()

rank       discipline  phd  service  sex     salary
AssocProf  A           10   8        Female  77500     1
Prof       A           36   19       Female  117555    1
           B           17   17       Female  111512    1
                            3        Male    150480    1
           A           51   51       Male    57800     1
                                                      ..
AsstProf   B           4    3        Male    91000     1
                            2        Female  80225     1
                            0        Male    92000     1
                       3    3        Female  92000     1
Prof       B           56   49       Male    186960    1
Name: count, Length: 78, dtype: int64

In [84]:
salaries_df['discipline'].value_counts()

discipline
B    42
A    36
Name: count, dtype: int64

In [85]:
salaries_df['sex'].value_counts()

sex
Male      39
Female    39
Name: count, dtype: int64

In [86]:
salaries_df['rank'].value_counts()

rank
Prof         46
AsstProf     19
AssocProf    13
Name: count, dtype: int64

In [87]:
# missing value detection
salaries_df.isnull().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

In [88]:
salaries_df.isna().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

# discriptive statistics

In [89]:
mean_salry = salaries_df['salary'].mean()
mean_salry

108023.78205128205

In [90]:
mean_phd = salaries_df['phd'].mean()
mean_phd

19.705128205128204

In [25]:
median_salry = salaries_df['salary'].median()
var_salry = salaries_df['salary'].var()
std_salry = salaries_df['salary'].std()
skw_salry = salaries_df['salary'].skew()
kurt_salary = salaries_df['salary'].kurt()
print(median_salry)
print(var_salry)
print(std_salry)
print(skw_salry)
print(kurt_salary)

104671.0
800531254.0427905
28293.661022264165
0.4521025675558812
-0.40171267588205417

In [26]:
count_rank = salaries_df['rank'].value_counts()
count_rank

rank
Prof         46
AsstProf     19
AssocProf    13
Name: count, dtype: int64

In [92]:
salaries_df[salaries_df['rank'] == 'Prof'].count()

rank          46
discipline    46
phd           46
service       46
sex           46
salary        46
dtype: int64

In [94]:
salary_prof = salaries_df[salaries_df['rank'] == 'Prof']
salary_assprof = salaries_df[salaries_df['rank'] == 'AsstProf']
salary_AssocProf = salaries_df[salaries_df['rank'] == 'AssocProf']

In [95]:
print(salary_prof['salary'].mean())
print(salary_assprof['salary'].mean())
print(salary_AssocProf['salary'].mean())

123624.80434782608
81362.78947368421
91786.23076923077

In [ ]:
what is average salary for male and female?
male = 115045.153
female = 101002.410

In [ ]:
what is avegare  male/ female prof salary?

In [98]:
df_prof = salary_prof[salary_prof['rank'] == 'Prof']

In [105]:
df_prof_male = df_prof[df_prof['sex'] == 'Male']
df_prof_male['salary'].mean()

124690.14285714286

In [106]:
salry_M_prof = salaries_df[(salaries_df['rank'] == 'Prof') & (salaries_df['sex'] == 'Male')]
salry_F_prof = salaries_df[(salaries_df['rank'] == 'Prof') & (salaries_df['sex'] == 'Female')]
# print(salry_M_prof.count())
print(salry_M_prof['salary'].mean())
print(salry_F_prof['salary'].mean())

124690.14285714286
121967.61111111111

# .loc, .iloc

In [65]:
salaries_df['discipline'][10:21:2]

10    A
12    B
14    A
16    B
18    A
20    A
Name: discipline, dtype: object

In [ ]:
.loc[row_index,column_index]

In [67]:
# .loc parameter
salaries_df.loc[0:10,'sex']

0       Male
1     Female
2     Female
3     Female
4     Female
5     Female
6       Male
7     Female
8     Female
9     Female
10    Female
Name: sex, dtype: object

In [68]:
salaries_df.loc[0:10,['sex','discipline','salary']]

       sex discipline  salary
0     Male          A   57800
1   Female          A   62884
2   Female          A   63100
3   Female          B   71065
4   Female          A   72500
5   Female          A   72500
6     Male          A   73000
7   Female          A   73300
8   Female          A   73500
9   Female          B   74692
10  Female          A   74830

In [69]:
salaries_df.loc[[0,5,9,60,50,30],['discipline','phd']]

   discipline  phd
0           A   51
5           A    3
9           B   11
60          B   39
50          A   36
30          B   10

In [70]:
salaries_df.loc[[0,5,6]]['salary']

0    57800
5    72500
6    73000
Name: salary, dtype: int64

In [71]:
salaries_df.loc[[30,2,1,5,6,15,60,40]][['salary','phd','salary']]

    salary  phd  salary
30   97032   10   97032
2    63100    7   63100
1    62884   25   62884
5    72500    3   72500
6    73000    4   73000
15   78500    8   78500
60  128250   39  128250
40  105000   12  105000

In [93]:
m = salaries_df.loc[:10,['salary','rank']]
m

    salary       rank
0    57800       Prof
1    62884  AssocProf
2    63100   AsstProf
3    71065  AssocProf
4    72500   AsstProf
5    72500   AsstProf
6    73000   AsstProf
7    73300  AssocProf
8    73500   AsstProf
9    74692   AsstProf
10   74830  AssocProf

# .iloc--> index integer location

In [72]:
df_rank = salaries_df.iloc[0:25,0:3]
df_rank

         rank discipline  phd
0        Prof          A   51
1   AssocProf          A   25
2    AsstProf          A    7
3   AssocProf          B   12
4    AsstProf          A    2
5    AsstProf          A    3
6    AsstProf          A    4
7   AssocProf          A   26
8    AsstProf          A    5
9    AsstProf          B   11
10  AssocProf          A   13
11   AsstProf          B    8
12   AsstProf          B    5
13  AssocProf          A   10
14   AsstProf          A    4
15   AsstProf          A    8
16   AsstProf          B    4
17  AssocProf          A   20
18   AsstProf          A    2
19   AsstProf          B    1
20       Prof          A   17
21   AsstProf          B    4
22       Prof          A   29
23       Prof          A   30
24   AsstProf          B    7

In [73]:
salaries_df.iloc[0:5][['rank','salary','sex']]

        rank  salary     sex
0       Prof   57800    Male
1  AssocProf   62884  Female
2   AsstProf   63100  Female
3  AssocProf   71065  Female
4   AsstProf   72500  Female

In [74]:
salaries_df.iloc[0:5,0:2]

        rank discipline
0       Prof          A
1  AssocProf          A
2   AsstProf          A
3  AssocProf          B
4   AsstProf          A

In [48]:
salaries_df.iloc[0:5,[1,3,4]]

  discipline  service     sex
0          A       51    Male
1          A       22  Female
2          A        6  Female
3          B        9  Female
4          A        0  Female

# pd.sort_values()

In [44]:
salaries_df

         rank discipline  phd  service     sex  salary
0        Prof          A   51       51    Male   57800
1   AssocProf          A   25       22  Female   62884
2    AsstProf          A    7        6  Female   63100
3   AssocProf          B   12        9  Female   71065
4    AsstProf          A    2        0  Female   72500
..        ...        ...  ...      ...     ...     ...
73       Prof          B   22       21    Male  155750
74       Prof          A   45       43    Male  155865
75       Prof          B   24       15  Female  161101
76       Prof          B   35       33    Male  162200
77       Prof          B   56       49    Male  186960

[78 rows x 6 columns]

In [47]:
df_highest_salary = salaries_df['phd'].sort_values(ascending=False)
df_highest_salary

77    56
0     51
74    45
67    45
62    40
      ..
27     3
5      3
4      2
18     2
19     1
Name: phd, Length: 78, dtype: int64

In [49]:
salaries_df.sort_values(by = ['salary','phd','service'],ascending=False)

         rank discipline  phd  service     sex  salary
77       Prof          B   56       49    Male  186960
76       Prof          B   35       33    Male  162200
75       Prof          B   24       15  Female  161101
74       Prof          A   45       43    Male  155865
73       Prof          B   22       21    Male  155750
..        ...        ...  ...      ...     ...     ...
4    AsstProf          A    2        0  Female   72500
3   AssocProf          B   12        9  Female   71065
2    AsstProf          A    7        6  Female   63100
1   AssocProf          A   25       22  Female   62884
0        Prof          A   51       51    Male   57800

[78 rows x 6 columns]

In [52]:
associate = salaries_df[salaries_df['rank']=='AssocProf'].sort_values(by ='phd',ascending=False)
associate

         rank discipline  phd  service     sex  salary
7   AssocProf          A   26       24  Female   73300
1   AssocProf          A   25       22  Female   62884
17  AssocProf          A   20       17    Male   81285
38  AssocProf          B   19        6  Female  104542
45  AssocProf          B   14        7  Female  109650
10  AssocProf          A   13        8  Female   74830
36  AssocProf          B   13       10  Female  103750
3   AssocProf          B   12        9  Female   71065
37  AssocProf          B   12       10  Female  103994
51  AssocProf          B   12        8    Male  119800
35  AssocProf          B   11       11  Female  103613
13  AssocProf          A   10        8  Female   77500
42  AssocProf          B    9        7    Male  107008

In [ ]:
associate[associate['sex'] == 'Male'].count()

# pd.groupby()

In [57]:
salaries_df.groupby('rank')['salary'].var()

rank
AssocProf    3.448889e+08
AsstProf     8.800776e+07
Prof         6.175368e+08
Name: salary, dtype: float64

In [59]:
mean_salary = salaries_df.groupby(['sex','rank'])['salary'].mean()
mean_salary

sex     rank
Female  AssocProf     88512.800000
        AsstProf      78049.909091
        Prof         121967.611111
Male    AssocProf    102697.666667
        AsstProf      85918.000000
        Prof         124690.142857
Name: salary, dtype: float64

In [60]:
mean_salary = salaries_df.groupby(['sex','rank','discipline'])
[['salary','phd','service']].mean().sort_values(by = 'salary',ascending = False)
mean_salary

                                    salary        phd    service
sex    rank      discipline
Male   Prof      B           137989.076923  29.538462  25.846154
Female Prof      B           131836.200000  21.500000  17.900000
Male   AssocProf B           113404.000000  10.500000   7.500000
       Prof      A           113164.400000  28.933333  22.733333
Female Prof      A           109631.875000  26.500000  16.125000
       AssocProf B            99435.666667  13.500000   8.833333
Male   AsstProf  B            88224.000000   4.666667   2.000000
Female AsstProf  B            84189.800000   6.600000   2.600000
Male   AssocProf A            81285.000000  20.000000  17.000000
       AsstProf  A            79000.000000   3.000000   1.000000
Female AsstProf  A            72933.333333   4.833333   2.500000
       AssocProf A            72128.500000  18.500000  15.500000

# pd.df.pivot_table()

In [61]:
pivot_values = salaries_df.pivot_table(values = ['salary','phd'],
                                       columns=['rank','sex','discipline'],
                                       aggfunc='mean')
pivot_values

rank       AssocProf                                       AsstProf           \
sex           Female                   Male                  Female
discipline         A             B        A         B             A        B
phd             18.5     13.500000     20.0      10.5      4.833333      6.6
salary       72128.5  99435.666667  81285.0  113404.0  72933.333333  84189.8

rank                                     Prof                           \
sex            Male                    Female                     Male
discipline        A             B           A         B              A
phd             3.0      4.666667      26.500      21.5      28.933333
salary      79000.0  88224.000000  109631.875  131836.2  113164.400000

rank
sex
discipline              B
phd             29.538462
salary      137989.076923

In [62]:
pivot_values_diff_agg = salaries_df.pivot_table(values = ['salary','phd','service'],
                                       columns=['rank','sex','discipline'],
                                       aggfunc={'salary':'mean',
                                               'phd':'count',
                                               'service':'min'})
pivot_values_diff_agg

rank       AssocProf                                       AsstProf           \
sex           Female                   Male                  Female
discipline         A             B        A         B             A        B
phd              4.0      6.000000      1.0       2.0      6.000000      5.0
salary       72128.5  99435.666667  81285.0  113404.0  72933.333333  84189.8
service          8.0      6.000000     17.0       7.0      0.000000      0.0

rank                                Prof
sex            Male               Female                Male
discipline        A        B           A         B         A              B
phd             2.0      6.0       8.000      10.0      15.0      13.000000
salary      79000.0  88224.0  109631.875  131836.2  113164.4  137989.076923
service         0.0      0.0       0.000      10.0       6.0       3.000000

In [120]:
salaries_df.isnull().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

# Titanic Data
## checking the missing observation
1) isna(), isnull(), info(), NAN--> not a number, not available number.
##  Handling the missing values
1) using fillna() Method
2) ffill Method
3) bfill Method
4) interpolate Method
5) replace the NA values
6) dropna()

In [75]:
import pandas as pd
train_df = pd.read_csv(r"C:\Users\excel\Downloads\train.csv")
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [76]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [77]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [105]:
train_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
# if axis = 1 (columnwise deletion/selection), i axis = 0(rowise deletion/selection)

In [78]:
train_df_1 = train_df.rename({'Ticket':'Ticket_Number'},axis = 1)
train_df_1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket_Number,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [80]:
mean_age = round(train_df['Age'].mean())
mean_age

30

In [81]:
train_df_1['Age'].fillna(mean_age,inplace = True)

C:\Users\excel\AppData\Local\Temp\ipykernel_42356\3346682596.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  train_df_1['Age'].fillna(mean_age,inplace = True)

In [82]:
train_df_1.isnull().sum()

PassengerId        0
Survived           0
Pclass             0
Name               0
Sex                0
Age                0
SibSp              0
Parch              0
Ticket_Number      0
Fare               0
Cabin            687
Embarked           2
dtype: int64

### object type of missing observation filling.

In [83]:
train_df_1['Cabin'].isnull().sum()

687

In [86]:
train_df_1['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [87]:
# bfill --> backword filling
train_df_1['Cabin'].bfill(inplace = True)

In [91]:
train_df_1['Cabin'].tail()

886     B42
887     B42
888    C148
889    C148
890    C148
Name: Cabin, dtype: object

In [90]:
# ffill --> forward filling
train_df_1['Cabin'].ffill(inplace = True)

In [135]:
train_df_1['Cabin'].isnull().sum()

0

In [92]:
train_df_1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket_Number    0
Fare             0
Cabin            0
Embarked         2
dtype: int64

In [97]:
train_df_1['Embarked'].value_counts()

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [94]:
import numpy as np
train_df_1['Embarked'].replace(np.nan,'S',inplace = True)

C:\Users\excel\AppData\Local\Temp\ipykernel_42356\1184458572.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  train_df_1['Embarked'].replace(np.nan,'S',inplace = True)

In [113]:
train_df[train_df['Age'].isna() == True]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [95]:
train_df_1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket_Number    0
Fare             0
Cabin            0
Embarked         0
dtype: int64

In [145]:
train_df['Age'].isnull().sum()

177

In [114]:
train_df['Age'].interpolate(method = 'linear',inplace = True)

In [115]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [118]:
train_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [ ]:
# How many male passengers are  in titanic ship? 
male passanger = 577

# which passenger class has highest customers?
class3 == 491

# which Passenger class has highest fare price? 
class1 == 84.154

# calculate the average fare price for male and female passenger?
avg_fare_price_male = 25.52
avg_fare_price_female == 44.4798

# what is survival ratio?
surival_ratio = 0.387

# which age group is max survived?
age_groups  survival_ratio
[0-20]         
[21-40]        
[41-60]          
[60-90]        


# survived ratio for passenger class by gender.

In [122]:
#[0-20]
df1 = train_df_1[(train_df_1['Age'] > 0) & (train_df_1['Age']<=20)]

In [141]:
df_1 = len(df1[df1['Survived'] == 1])/len(train_df_1)

In [143]:
df2 = train_df_1[(train_df_1['Age'] > 20) & (train_df_1['Age']<=40)]
df_2 = len(df2[df2['Survived'] == 1])/len(train_df_1)

In [144]:
df3 = train_df_1[(train_df_1['Age'] > 40) & (train_df_1['Age']<=60)]
df_3 = len(df3[df3['Survived'] == 1])/len(train_df_1)

In [145]:
df4 = train_df_1[(train_df_1['Age'] > 60) & (train_df_1['Age']<=80)]
df_4 = len(df4[df4['Survived'] == 1])/len(train_df_1)

In [146]:
df_1+df_2+df_3+df_4

0.3838383838383838

In [151]:
train_df_1.pivot_table(values='Survived',columns=['Pclass','Sex'],aggfunc = 'sum')/891

Pclass           1                   2                  3
Sex         female      male    female     male    female     male
Survived  0.102132  0.050505  0.078563  0.01908  0.080808  0.05275

In [150]:
91+45+70+17+72+47

342

In [148]:
train_df.groupby(['Sex'])['Fare'].mean()

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [149]:
SR = 342/891
SR

0.3838383838383838

In [153]:
train_df['Age'] = train_df['Age'].astype('int64')

In [154]:
train_df['Age'].min(),train_df['Age'].max()

(0, 80)

In [165]:
df_20 = train_df[train_df['Age'] <= 20]
df_20[df_20['Survived'] == 1].count()

PassengerId    94
Survived       94
Pclass         94
Name           94
Sex            94
Age            94
SibSp          94
Parch          94
Ticket         94
Fare           94
Cabin          25
Embarked       94
dtype: int64

In [174]:
df_40 = train_df[(train_df['Age'] > 20) & (train_df['Age'] <= 40)]
df_40[df_40['Survived'] == 1].count()

PassengerId    183
Survived       183
Pclass         183
Name           183
Sex            183
Age            183
SibSp          183
Parch          183
Ticket         183
Fare           183
Cabin           73
Embarked       182
dtype: int64

In [176]:
df_60 = train_df[(train_df['Age'] > 40) & (train_df['Age'] <= 60)]
df_60[df_60['Survived'] == 1].count()

PassengerId    60
Survived       60
Pclass         60
Name           60
Sex            60
Age            60
SibSp          60
Parch          60
Ticket         60
Fare           60
Cabin          35
Embarked       60
dtype: int64

In [177]:
df_80 = train_df[(train_df['Age'] > 60) & (train_df['Age'] <= 80)]
df_80[df_80['Survived'] == 1].count()

PassengerId    5
Survived       5
Pclass         5
Name           5
Sex            5
Age            5
SibSp          5
Parch          5
Ticket         5
Fare           5
Cabin          3
Embarked       4
dtype: int64

In [153]:
df20 = round(94 / 891,3)
df40 = round(183/891,3)
df60 = round(60 / 891,3)
df80 = round(5 / 891,3)
print(df20,df40,df60,df80)

0.105 0.205 0.067 0.006

In [154]:
df20+df40+df60+df80

0.383

In [155]:
# survival by age group
survival_age = {'age_group':['0-20','21-40','41-60','61-80'],
               'values':[df20,df40,df60,df80]}

In [156]:
survival_age

{'age_group': ['0-20', '21-40', '41-60', '61-80'],
 'values': [0.105, 0.205, 0.067, 0.006]}

In [157]:
pd.DataFrame(survival_age)

  age_group  values
0      0-20   0.105
1     21-40   0.205
2     41-60   0.067
3     61-80   0.006

In [208]:
df_20_female = df_20[(df_20['Survived'] == 1) & (df_20['Sex'] == 'female')].count()
df_20_male = df_20[(df_20['Survived'] == 1) & (df_20['Sex'] == 'male')].count()

In [210]:
df_40_female = df_40[(df_40['Survived'] == 1) & (df_40['Sex'] == 'female')].count()
df_40_male = df_40[(df_40['Survived'] == 1) & (df_40['Sex'] == 'male')].count()

In [211]:
female_sur_20 = df_20_female.Sex/94
male_sur_20 = df_20_male.Sex/94

In [212]:
female_sur_40 = df_40_female.Sex/183
male_sur_40 = df_40_male.Sex/183

In [213]:
female_sur_40,male_sur_40

(0.6939890710382514, 0.30601092896174864)